Revit 2024 API
MassSurfaceData.IsUnderground Property
 Indicates if the roof, floor, slab, or wall surface reference is underground.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsUnderground { get; set; }
Visual Basic
Public Property IsUnderground As Boolean
	Get
	Set
Visual C++
public:
property bool IsUnderground {
	bool get ();
	void set (bool value);
}
See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace